{
  "generalIntroductoryQuestions": [
    "To what extent is the report a fairly accurate description of your current characteristics?",
    "Does your highest score represent a personal strength? Your lowest an area for development?",
    "If you had to challenge a score, or adjust it, which would it be, and why?",
    "Think back over the last few weeks. What are you currently finding hard about study at this level?",
    "Before we look at the rest of the report, remember… [insert comment depending upon scores]"
  ],
  "conditionalFramingStatements": [
    {
      "id": "default_response",
      "description": "Default response if no other specific pattern matches.",
      "conditionLogic": {
        "type": "default"
      },
      "statement": "…that if you answer the questions below honestly, you will soon be in a good position to make manageable and meaningful changes to the way you work, lowering your stress and increasing feelings of confidence and control."
    },
    {
      "id": "4_or_5_of_5_low",
      "description": "If 4 out of 5 scores are 3 or below, or 5 out of 5 scores are 3 or below (on 1-10 scale, this means <= 3).",
      "conditionLogic": {
        "type": "count_low_scores",
        "maxScoreForLow": 3, 
        "thresholdCounts": [4, 5]
      },
      "statement": "…these numbers are just a snapshot of how you feel right now. Small, manageable changes to the way you work will vastly improve how you feel about your potential. It might not take too long to improve things. Answering the questions below honestly will be a good starting point."
    },
    {
      "id": "vision_attitude_low",
      "description": "If vision and attitude are both 3 or below (on 1-10 scale, <= 3), and other scores are above 3.",
      "conditionLogic": {
        "type": "specific_elements_low_others_not",
        "lowElements": ["Vision", "Attitude"],
        "maxScoreForLow": 3
      },
      "statement": "…it's quite normal to feel you don't know what you're trying to achieve or why you're studying. But by answering the questions below honestly, reflecting on this report, and making small, manageable changes, you could soon be feeling much more positive."
    },
    {
      "id": "vision_effort_low",
      "description": "If vision and effort are both 3 or below, but other scores are above 3.",
      "conditionLogic": {
        "type": "specific_elements_low_others_not",
        "lowElements": ["Vision", "Effort"],
        "maxScoreForLow": 3
      },
      "statement": "…your study habits from last year don't define who you are now. By making small, manageable changes to the way you work, you could soon find your habits changing and your grades improving. Consider the questions below, and try answering as honestly and openly as you can."
    },
    {
      "id": "effort_systems_low",
      "description": "If effort and systems are both 3 or below, but other scores are above 3.",
      "conditionLogic": {
        "type": "specific_elements_low_others_not",
        "lowElements": ["Effort", "Systems"],
        "maxScoreForLow": 3
      },
      "statement": "…your study habits and levels of organisation last year don't define who you are now, or who you want to become. By making small, manageable changes to the way you work, you could soon find your habits changing and your grades improving. Considering the questions below honestly and openly might be a positive first step."
    },
    {
      "id": "effort_practice_low",
      "description": "If effort and practice are both 3 or below, but other scores are above 3.",
      "conditionLogic": {
        "type": "specific_elements_low_others_not",
        "lowElements": ["Effort", "Practice"],
        "maxScoreForLow": 3
      },
      "statement": "…your study habits and your approach to revision last year doesn't define who you are now, or who you want to become. Consider making small, manageable changes to the way you work – you could soon find your habits changing and your grades improving. Answer the questions below with as much honesty and openness as you can – it will give you a good starting point to work from."
    },
    {
      "id": "systems_practice_low",
      "description": "If systems and practice are both 3 or below, but other scores are above 3.",
      "conditionLogic": {
        "type": "specific_elements_low_others_not",
        "lowElements": ["Systems", "Practice"],
        "maxScoreForLow": 3
      },
      "statement": "…the way you organised yourself and your revision last year doesn't define who you are now. You can still make small, manageable changes to the way you study, and you could soon find your habits changing and your grades improving. Considering the questions below honestly and openly will be a positive first step."
    }
  ],
  "vespaSpecificCoachingQuestions": {
    "Vision": [
      {
        "scoreProfile": "Very Low", 
        "questions": [
          "If you could only do one subject in lots of detail, which would it be and why?",
          "Describe a lesson you've enjoyed recently.",
          "What obstacles do you think you may have to overcome while studying at this level?",
          "What do you want to achieve in the next year?"
        ]
      },
      {
        "scoreProfile": "Low", 
        "questions": [
          "If you could only do one subject in lots of detail, which would it be and why?",
          "Describe a lesson you've enjoyed recently.",
          "What obstacles do you think you may have to overcome while studying at this level?",
          "What do you want to achieve in the next year?"
        ]
      },
      {
        "scoreProfile": "Medium",
        "questions": [
          "What does success look like for you?",
          "What would be important to you in a job? Describe a good day at work."
        ]
      },
      {
        "scoreProfile": "High",
        "questions": [
          "What do you want to do next? What if you don't get the grades? What other options are there?"
        ]
      }
    ],
    "Effort": [
      {
        "scoreProfile": "Very Low",
        "questions": [
          "How many hours have you studied for this week outside the classroom? How many hours do you think you should be studying?",
          "Are you working now as hard as you did last year or earlier in your school career?",
          "For your last homework, was your objective… to avoid doing it for as long as possible… to complete it as quickly as possible… or to get the best possible grade?",
          "Name a student who works harder than you. What do they do?"
        ]
      },
      {
        "scoreProfile": "Low",
        "questions": [
          "How many hours have you studied for this week outside the classroom? How many hours do you think you should be studying?",
          "Are you working now as hard as you did last year or earlier in your school career?",
          "For your last homework, was your objective… to avoid doing it for as long as possible… to complete it as quickly as possible… or to get the best possible grade?",
          "Name a student who works harder than you. What do they do?"
        ]
      },
      {
        "scoreProfile": "Medium",
        "questions": [
          "If you get stuck on a piece of work, what do you do to get past the blockage?",
          "Where do you normally spend your study periods?"
        ]
      },
      {
        "scoreProfile": "High",
        "questions": [
          "In an average week how many hours do you spend on hard/challenging/uncomfortable study outside of class?"
        ]
      }
    ],
    "Systems": [
      {
        "scoreProfile": "Very Low",
        "questions": [
          "Would you rather spend 1 hour working in class or 1 hr working at home? Why?",
          "How do you know what work is currently outstanding?",
          "If you could change one aspect about the way you work – what would it be and how would you change it?",
          "How do you tackle writing an extended response to a difficult question if you're given ten days to do it?"
        ]
      },
      {
        "scoreProfile": "Low",
        "questions": [
          "Would you rather spend 1 hour working in class or 1 hr working at home? Why?",
          "How do you know what work is currently outstanding?",
          "If you could change one aspect about the way you work – what would it be and how would you change it?",
          "How do you tackle writing an extended response to a difficult question if you're given ten days to do it?"
        ]
      },
      {
        "scoreProfile": "Medium",
        "questions": [
          "Do you still work in the same ways as you used to? What is good about these ways? What isn't working and why?",
          "Suggest an object/thing – maybe something you could buy or borrow - that would make you more organised."
        ]
      },
      {
        "scoreProfile": "High",
        "questions": [
          "What is next week looking like for you?"
        ]
      }
    ],
    "Practice": [
      {
        "scoreProfile": "Very Low",
        "questions": [
          "Is revision boring for you? Why? Explain your answer.",
          "If you could pick one activity to use to revise for an exam what would it be?",
          "Do you do past paper questions? Describe the last time you tried something under timed conditions.",
          "Choose a subject. If you had one hour, and no homework, what would you do to help your learning in it?"
        ]
      },
      {
        "scoreProfile": "Low",
        "questions": [
          "Is revision boring for you? Why? Explain your answer.",
          "If you could pick one activity to use to revise for an exam what would it be?",
          "Do you do past paper questions? Describe the last time you tried something under timed conditions.",
          "Choose a subject. If you had one hour, and no homework, what would you do to help your learning in it?"
        ]
      },
      {
        "scoreProfile": "Medium",
        "questions": [
          "What's the hardest exam question you expect to face? What are you doing about it?",
          "How comfortable is the process of revision for you? How could you make it less comfortable?"
        ]
      },
      {
        "scoreProfile": "High",
        "questions": [
          "Pick one of your subjects- which aspects of this subject do you least need to revise? Why?"
        ]
      }
    ],
    "Attitude": [
      {
        "scoreProfile": "Very Low",
        "questions": [
          "What have you done since the start of the year that you are proud of?",
          "Name something you have persevered with in the past.",
          "Are you willing to contribute in class? Name a student who contributes more than you. What is their learning like?",
          "Advise your friend if they have a grade they're unhappy with.."
        ]
      },
      {
        "scoreProfile": "Low",
        "questions": [
          "What have you done since the start of the year that you are proud of?",
          "Name something you have persevered with in the past.",
          "Are you willing to contribute in class? Name a student who contributes more than you. What is their learning like?",
          "Advise your friend if they have a grade they're unhappy with.."
        ]
      },
      {
        "scoreProfile": "Medium",
        "questions": [
          "What's the biggest mistake you have made so far? What have you learnt/how did you deal with it?",
          "What do you feel is the difference between you and a top 'A grade' student? List five if you can"
        ]
      },
      {
        "scoreProfile": "High",
        "questions": [
          "When something goes wrong in your studies, what do you do?"
        ]
      }
    ]
  }
} 